## Plan for org_account/roles
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**❌ &nbsp; Conftest:** `failed` 

```terraform
Plan: 6 to add, 2 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                 NAME                                  |
|--------|-----------------------------------------------------------------------|
| update | `aws_iam_policy.org_account_list_in_sandbox`                          |
|        | `aws_iam_policy.org_allow_policy_toggle`                              |
| add    | `aws_iam_policy.assume_sre_identity_audit`                            |
|        | `aws_iam_policy.sre_identity_audit`                                   |
|        | `aws_iam_role.sre_identity_audit`                                     |
|        | `aws_iam_role_policy_attachment.assume_sre_identity_audit`            |
|        | `aws_iam_role_policy_attachment.sre_identity_audit`                   |
|        | `module.OIDC_Roles.aws_iam_role.this[&quot;sre_identity_audit_oidc_role&quot;]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.assume_sre_identity_audit will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_sre_identity_audit" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "sts:AssumeRole",
            ]
          + resources = [
              + "arn:aws:iam::659087519042:role/sre_identity_audit",
              + (known after apply),
            ]
          + sid       = "AssumeSREIdentityAuditRoles"
        }
    }

  # aws_iam_policy.assume_sre_identity_audit will be created
  + resource "aws_iam_policy" "assume_sre_identity_audit" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "sre_identity_audit_oidc_role"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags      = {
          + "CostCentre" = "cds-aws-lz-production"
          + "Terraform"  = "true"
        }
      + tags_all  = {
          + "CostCentre" = "cds-aws-lz-production"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy.org_account_list_in_sandbox will be updated in-place
  ~ resource "aws_iam_policy" "org_account_list_in_sandbox" {
        id        = "arn:aws:iam::659087519042:policy/listAccountsInSandboxOUForNuke"
        name      = "listAccountsInSandboxOUForNuke"
      ~ tags      = {
          + "CostCentre" = "cds-aws-lz-production"
          + "Terraform"  = "true"
        }
      ~ tags_all  = {
          + "CostCentre" = "cds-aws-lz-production"
          + "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_iam_policy.org_allow_policy_toggle will be updated in-place
  ~ resource "aws_iam_policy" "org_allow_policy_toggle" {
        id        = "arn:aws:iam::659087519042:policy/ghActionAllowPolicyToggle"
        name      = "ghActionAllowPolicyToggle"
      ~ tags      = {
          + "CostCentre" = "cds-aws-lz-production"
          + "Terraform"  = "true"
        }
      ~ tags_all  = {
          + "CostCentre" = "cds-aws-lz-production"
          + "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_iam_policy.sre_identity_audit will be created
  + resource "aws_iam_policy" "sre_identity_audit" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "sre_identity_audit"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "identitystore:ListUsers",
                          + "identitystore:ListGroups",
                          + "identitystore:ListGroupMemberships",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:identitystore:ca-central-1:659087519042:identitystore/*"
                      + Sid      = "ReadIdentityStore"
                    },
                  + {
                      + Action   = [
                          + "sso-admin:ListPermissionSetsProvisionedToAccount",
                          + "sso-admin:ListPermissionSets",
                          + "sso-admin:ListAccountsForProvisionedPermissionSet",
                          + "sso-admin:ListAccountAssignments",
                          + "sso-admin:DescribePermissionSet",
                          + "sso-admin:DescribeInstance",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:sso:::instance/ssoins-*"
                      + Sid      = "ReadSSOAdmin"
                    },
                  + {
                      + Action   = "organizations:ListAccounts"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:organizations::659087519042:account/*"
                      + Sid      = "ReadOrganizations"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags      = {
          + "CostCentre" = "cds-aws-lz-production"
          + "Terraform"  = "true"
        }
      + tags_all  = {
          + "CostCentre" = "cds-aws-lz-production"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_role.sre_identity_audit will be created
  + resource "aws_iam_role" "sre_identity_audit" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::659087519042:role/sre_identity_audit_oidc_role"
                        }
                      + Sid       = "AssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sre_identity_audit"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "cds-aws-lz-production"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "cds-aws-lz-production"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.assume_sre_identity_audit will be created
  + resource "aws_iam_role_policy_attachment" "assume_sre_identity_audit" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "sre_identity_audit_oidc_role"
    }

  # aws_iam_role_policy_attachment.sre_identity_audit will be created
  + resource "aws_iam_role_policy_attachment" "sre_identity_audit" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "sre_identity_audit"
    }

  # module.OIDC_Roles.aws_iam_role.this["sre_identity_audit_oidc_role"] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + "token.actions.githubusercontent.com:sub" = [
                                  + "repo:cds-snc/site-reliability-engineering:ref:refs/heads/main",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::659087519042:oidc-provider/token.actions.githubusercontent.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sre_identity_audit_oidc_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "cds-aws-lz-production"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "cds-aws-lz-production"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)
    }

Plan: 6 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
FAIL - plan.json - main - Policy document has invalid effect: ["data.aws_iam_policy_document.assume_sre_identity_audit"]

20 tests, 19 passed, 0 warnings, 1 failure, 0 exceptions

```

</details>
